//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2023, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************
/=#
#include "VFR.uni"

#string STR_OEM_CTRL_OK          #language    en-US    "Ok"
                                 #language    zh-chs    "接受"
#string STR_OEM_CTRL_CANCEL      #language    en-US    "Cancel"
                                 #language    zh-chs    "取消"
#string STR_OEM_CTRL_NO          #language    en-US    "No"
                                 #language    zh-chs    "拒绝"
#string STR_INSERVICE_INFO       #language    en-US    "-----------------User Experience Improvement Program Statement------------------"
                                                       "|IEIT SYSTEM Co., Ltd. and its affiliated companies (hereinafter referred to as|"
                                                       "|\"IEIT SYSTEM\"), thank you for your trust in IEIT SYSTEM. In order to improve  |"
                                                       "|the user experience, we sincerely invite you to participate in the IEIT SYSTEM|"
                                                       "|User Experience Improvement Plan (hereinafter referred to as \"the Plan\"). You |"
                                                       "|can decide whether to participate in the plan at your own discretion. Before  |"
                                                       "|you join the plan, you must carefully of this statement. If you disagree with |"
                                                       "|any of the terms, please stop joining the program.                            |"
                                                       "|1) In the plan, the server will automatically install ISMD on the OS system,  |"
                                                       "|and the out-of-band BMC and ISMD will automatically transmit the server       |"
                                                       "|operation and maintenance data to IEIT SYSTEM.                                |"
                                                       "|Out-of-band BMC operation and maintenance data mainly include asset           |"
                                                       "|information, hardware information, alarm information, etc. of themanagement   |"
                                                       "|equipment.                                                                    |"
                                                       "|The specific operation and maintenance data are described as follows:         |"
                                                       "|  Asset information of the equipment includes equipment model, equipment      |"
                                                       "|serial number (SN), hardware information (including CPU, hard disk, memory,   |"
                                                       "|motherboard, PCIE equipment, graphics card, network card and other basic      |"
                                                       "|parameter information), etc;                                                  |"
                                                       "|  Alarm information of the equipment includes equipment fault alarm, threshold|"
                                                       "|alarm, etc;                                                                   |"
                                                       "|  ISMD operation and maintenance data mainly includes asset information,      |"
                                                       "|hardware information, alarm information, etc. of the management equipment.    |"
                                                       "--Press \"↓\" to continue, Press \"↑\" to go back to the previous page----Page 1/3--"
                                #language    zh-chs    "------------------------------用户体验改进计划声明------------------------------"
                                                        "|浪潮电子信息产业股份有限公司及其关联公司(以下简称\"浪潮信息\")，感谢您对浪潮信息|"
                                                        "|的信任，为了提升用户体验，诚挚邀请您参与浪潮信息用户体验改进计划(以下简称\"计划|"
                                                        "|\")。您可自行决定是否参与本计划，您加入本计划前请务必仔细阅读本声明所有内容。若|" 
                                                        "|您对本声明的任何条款有异议，请停止加入本计划。                                |"
                                                        "|1) 加入本计划，服务器自动把ISMD安装OS系统上，同时带外BMC和ISMD会自动将管理设备|"
                                                        "|的运维数据传输给浪潮信息。                                                    |"
                                                        "|带外BMC运维数据主要包括管理设备的资产信息、硬件信息、性能信息、告警信息等。   |"
                                                        "|具体运维数据说明如下:                                                         |"
                                                        "|    设备的资产信息包括设备型号、设备序列号(SN)、硬件信息(包括CPU、硬盘、内存、|"
                                                        "|主板、PCIE设备、显卡、网卡等基本参数信息)等;                                  |"
                                                        "|    设备的告警信息包括设备故障告警、阈值告警等;                               |"
                                                        "|ISMD运维数据主要包括 管理设备的资产信息、硬件信息、性能信息、告警信息等。     |"
                                                        "|具体运维数据说明如下:                                                         |"
                                                        "|    设备的资产信息包括设备型号、设备序列号(SN)、硬件信息(包括CPU、硬盘、内存、|"
                                                        "|主板、PCIE设备、显卡、网卡等基本参数信息)等;                                  |"
                                                        "|    设备的告警信息包括设备故障告警、阈值告警等;                               |"
                                                        "|    我们将对所收集的数据进行分析，发现可能出现的问题并用于产品质量、服务质量和|"
                                                        "|用户体验的改进。                                                              |"
                                                        "|2) 浪潮信息非常重视个人信息和隐私的保护，加入本计划，不收集任何个人隐私数据和 |"
                                                        "|系统业务数据。                                                                |"
                                                        "|3) 浪潮信息收集的运维数据仅会传输并保存在中华人民共和国境内安全的云环境上，仅 |"
                                                        "|当处理数据以用于本计划时才访问该环境。                                        |"
                                                        "--按\"↓\"键继续，按\"↑\"键返回上一页----------------------------------------页 1/2--"

#string STR_INSERVICE_INFO1      #language    en-US    "-----------------User Experience Improvement Program Statement------------------"
                                                       "|The specific operation and maintenance data are described as follows:         |"
                                                       "|  Asset information of the equipment includes equipment model, equipment      |"
                                                       "|serial number (SN), hardware information (including CPU, hard disk, memory,   |"
                                                       "|motherboard, PCIE equipment, graphics card, network card and other basic      |"
                                                       "|parameter information), etc;                                                  |"
                                                       "|  Alarm information of the equipment includes equipment fault alarm, threshold|"
                                                       "|alarm, etc;                                                                   |"
                                                       "|  We will analyze the data we collect to find possible problems and apply     |"
                                                       "|them to improve product quality, service quality and user experience.         |"
                                                       "|2) IEIT SYSTEM attaches great importance to the protection of personal        |"
                                                       "|information and privacy, joins the Plan, and does not collect any personal    |"
                                                       "|privacy data and system business data.                                        |"
                                                       "|3) The operation and maintenance data collected by IEIT SYSTEM will only be   |"
                                                       "|transmitted and stored in a secure cloud environment in the People's Republic |"
                                                       "|of China, and will only be accessed when processing data for the plan.        |"
                                                       "|4) After the completion of the plan, the data uploaded to IEIT SYSTEM for the |"
                                                       "|purpose of the plan will be automatically deleted after three years.          |"
                                                       "|5) If you need to stop the plan, you need to set it in the out-of-band BMC and|"
                                                       "|ISMD respectively:                                                            |"
                                                       "|  Out-of-band BMC needs to enable/disable data collection and transmission in |"
                                                       "|\"Settings\".                                                                   |"
                                                       "|  To delete ISMD, go to the ISMD installation directory (/opt/ismd_inservice/ |"
                                                       "--Press \"↓\" to continue, Press \"↑\" to go back to the previous page----Page 2/3--"
                                                       
                                #language    zh-chs     "------------------------------用户体验改进计划声明------------------------------"
                                                        "|4) 本计划结束后，为了本计划目的上传至浪潮信息的数据存储期满3年后自动删除。    |"
                                                        "|5) 如果您需要停止本计划，需要分别在带外BMC和ISMD中进行设置:                   |"
                                                        "|带外BMC需在\"设置\"中启用/禁用数据的收集和传输 。                               |"
                                                        "|ISMD的删除需要进入系统ismd安装目录，默认/opt/ismd_inservice/，执行./uninstall.|"
                                                        "|sh即可完成卸载。                                                              |"
                                                        "|6) 对于本计划收集的所有数据，除用于前述目的外，浪潮信息将严格保密，除了法律法 |"
                                                        "|规、国家机关要求提供外，不会向任何第三方提供、公开或者共享。                  |"
                                                        "|7) 浪潮信息关联公司，是指现在、将来受浪潮电子信息产业股份有限公司控制、控制该 |"
                                                        "|公司或与该公司受第三方共同控制的公司(或其他实体)。控制指通过所有权、有投票权的|"
                                                        "|股份、合同、实际运营关联或其他被依法认定的方式直接或间接地拥有影响被控制对象管|"
                                                        "|理/经营的能力。                                                               |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "|                                                                              |"
                                                        "--------------------------------------------------------------------------------"
                                                        "--按\"↓\"键继续，按\"↑\"键返回上一页------------------------------------------------"
                                                        "--按 \"Y\"接受，按 \"N\"拒绝，按 \"C\"退出------------------------------------页 2/2--"


#string STR_INSERVICE_INFO2      #language    en-US   "-----------------User Experience Improvement Program Statement------------------"
                                                      "|by default) and run./uninstall.sh to complete the uninstallation.             |"                                                     
                                                      "|6) For all data collected in the Plan, except for the above purposes, IEIT    |"
                                                      "|SYSTEM will strictly keep confidential for this, and will not be provided,    |"
                                                      "|disclosed or shared to any third party except as required by laws, regulations|"
                                                      "|and national authorities.                                                     |"
                                                      "|7) Associates of IEIT SYSTEM refer to companies (or other entities) that are  |"
                                                      "|currently or will be controlled by IEIT SYSTEM Co., Ltd. \"Control\" means      |"
                                                      "|having the ability, directly or indirectly, to affect the management/operation|"  
                                                      "|of the controlled entity through ownership, voting rights, contracts, actual  |"
                                                      "|operation association, or other legally recognized means.                     |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "|                                                                              |"
                                                      "--------------------------------------------------------------------------------"
                                                      "--Press \"↓\" to continue, Press \"↑\" to go back to the previous page--------------"
                                                      "--Press \"Y\" to accept, \"N\" to reject, \"C\" to exit---------------------Page 3/3--"
